source/_posts/2014-09-21-storing-or-excluding-node-modules-in-rails-git-repositories.html
---
layout: post
title: "Storing or Excluding Node Modules in Rails Git Repositories"
date: 2014-09-28 19:06:42 -0700
comments: true
categories: [webpack, npm]
keywords: webpack, npm, git
description: Should you store your node_modules in your git repository or configure git to ignore the node_modules directory.
canonical: https://www.shakacode.com/blog/storing-or-excluding-node-modules-in-rails-git-repositories/
---

<p>
It was and probably still is fashionable in the node community to check the
dependencies into one's git repository, and it may still be the case, per the
following links. However, Rubyists use <code>bundler</code>, and I've never heard of
checking gem dependencies into a Ruby project. So what do we do when we have
Node dependencies in a Rails project?
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Reasons to include node_modules in git</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Stack Overflow on <a href="http://stackoverflow.com/a/19416403/1009332">why you should check node_modules into git</a> and <b>not</b> have
node_modules in your <code>.gitignore</code>.
</li>
<li><a href="http://www.futurealoof.com/posts/nodemodules-in-git.html">Mikeal Rogers' post on this.</a> Note, this post was from 2011. He says:

<blockquote>
<p>
Why can’t I just use version locking to ensure that all deployments get the
same dependencies?
</p>

<p>
Version locking can only lock the version of a top level dependency. You lock
your version of express to a particular version and you deploy to a new machine
3 weeks later it’s going to resolve express’s dependencies again and it might
get a new version of Connect that introduces subtle differences that break your
app in super annoying and hard to debug ways because it only ever happens when
requests hit that machine. This is a nightmare, don’t do it.
</p>
</blockquote>

<p>
and concludes with:
</p>

<blockquote>
<p>
All you people who added node_modules
to your gitignore, remove that shit, today, it’s an artifact of an era we’re
all too happy to leave behind. The era of global modules is dead."
</p>
</blockquote>

<p>
And so this was all true, but before node-shrinkwrap was released (see below)!
</p>
</li>
<li>The <a href="https://www.npmjs.org/doc/misc/npm-faq.html#Should-I-check-my-node_modules-folder-into-git">Node FAQ</a> clearly states:  
<ol class="org-ol">
<li>Check node_modules into git for things you deploy, such as websites and
apps.
</li>
<li>Use npm to manage dependencies in your dev environment, but not in your
deployment scripts.
</li>
</ol>
</li>
</ol>

<!-- more -->
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Reasons not to include node_modules in git</h2>
<div class="outline-text-2" id="text-2">
<p>
Including node_modules in your git repo greatly increases the potential file
churn for files that your team did not create, thus making pull requests on
github problematic due to large numbers of files with changes.
</p>

<p>
One problem with <code>npm install</code> is that while your package.json file may be
locking down your dependency versions, it does not lock down your dependencies'
dependencies!
</p>

<p>
Instead, one can use <a href="https://www.npmjs.org/doc/cli/npm-shrinkwrap.html">npm-shrinkwrap</a> to lock down all the dependencies, per
this answer for <a href="http://stackoverflow.com/questions/18128863/should-node-modules-folder-be-included-in-the-git-repository">Should “node-modules” folder be included in the git repository</a>.
It's worth noting that supposedly Heroku will use npm-shrinkwrap.json, per <a href="http://stackoverflow.com/questions/11225809/heroku-does-not-respect-npm-shrinkwrap-json">this answer on Stack Overflow</a>. 
Probably the best documentation for this is in the <a href="https://www.npmjs.org/doc/cli/npm-install.html">npm-install man page</a>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Conclusion</h2>
<div class="outline-text-2" id="text-3">
<p>
Consequently, I'm going with the approach <i><b>not</b></i> including node_modules in my
git repository by:
</p>
<ol class="org-ol">
<li>Using  <a href="https://www.npmjs.org/doc/cli/npm-shrinkwrap.html">npm-shrinkwrap</a>.
</li>
<li>Placing <code>node_modules</code> in my project specific <code>.gitignore</code>.
</li>
</ol>

<p>
I'll do this for my projects until I'm convinced of otherwise! 
</p>
</div>
</div>
